backend/Data/Input/oepsoapRequestXmls/oepsoaprequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://dhiraagu.com.mv/OEP/OrderManagement/Order/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:OrderEntryRequest>
         <v1:ProcessModifyOrder>
            <v1:ListOfOEPOrder>
               <v1:OEPOrder>
                  <v1:CUS_FLD_CONTACTS>
                     <v1:CUS_FLD_EMAIL>dr.raghavendra.m@gmail.com</v1:CUS_FLD_EMAIL>
                     <v1:PHONE>7500946</v1:PHONE>
                  </v1:CUS_FLD_CONTACTS>
                  <v1:MobileBBService>
                     <v1:ChangePlan>
                        <v1:AccountNo>PC00072251</v1:AccountNo>
                        <v1:MsIsdn>9607660946</v1:MsIsdn>
                        <v1:Plan>
                           <v1:PlanName>PostBroadband699</v1:PlanName>
                           <v1:PlanStartDate>2025-01-23</v1:PlanStartDate>
                           <v1:PlanAction>Change</v1:PlanAction>
                        </v1:Plan>
                        <v1:OrderName>ModifyMobileBroadbandService-ChangePlan</v1:OrderName>
                        <v1:OrderAction>ModifyMobileBroadbandService-ChangePlan</v1:OrderAction>
                        <v1:OrderStartDate>2025-01-23</v1:OrderStartDate>
                        <v1:OrderUserId>brt_support</v1:OrderUserId>
                        <v1:ChannelTrackingId>1729599674</v1:ChannelTrackingId>
                        <v1:CreditScore>1</v1:CreditScore>
                        <v1:SpendingCapMin>1498</v1:SpendingCapMin>
                        <v1:SpendingCapMax>2996</v1:SpendingCapMax>
                        <v1:SpendingCap>2247</v1:SpendingCap>
                        <v1:DepositPayment>
                           <v1:CollectedOn>2025-10-23T17:21:14</v1:CollectedOn>
                           <v1:DepositAmount>1000</v1:DepositAmount>
                           <v1:WaveOff>1</v1:WaveOff>
                           <v1:WaveOffReason>Employment Letter</v1:WaveOffReason>
                           <v1:DepositReceiptNo>NA</v1:DepositReceiptNo>
                           <v1:DepositType>0</v1:DepositType>
                           <v1:ServiceType>BB</v1:ServiceType>
                           <v1:PlanName>PostBroadband699</v1:PlanName>
                           <v1:DepositWaiver>1000</v1:DepositWaiver>
                        </v1:DepositPayment>
                     </v1:ChangePlan>
                  </v1:MobileBBService>
               </v1:OEPOrder>
            </v1:ListOfOEPOrder>
         </v1:ProcessModifyOrder>
      </v1:OrderEntryRequest>
   </soapenv:Body>
</soapenv:Envelope>